Revit 2018 API
BasicFileInfo.IsSavedInLaterVersion Property
 Checks if the file is saved in a later version of Revit than the running Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public bool IsSavedInLaterVersion { get; }
Visual Basic
Public ReadOnly Property IsSavedInLaterVersion As Boolean
	Get
Visual C++
public:
property bool IsSavedInLaterVersion {
	bool get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace